1-resman
terraform plan
```tf

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_billing_account_iam_member.default["project-factory-dev"] will be destroyed
  # (because key ["project-factory-dev"] is not in for_each map)
  - resource "google_billing_account_iam_member" "default" {
      - billing_account_id = "01C8D5-E4EA95-F2D624" -> null
      - etag               = "BwYvbP7DfIA=" -> null
      - id                 = "01C8D5-E4EA95-F2D624/roles/billing.user/serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member             = "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role               = "roles/billing.user" -> null
    }

  # google_billing_account_iam_member.default["project-factory-prod"] will be destroyed
  # (because key ["project-factory-prod"] is not in for_each map)
  - resource "google_billing_account_iam_member" "default" {
      - billing_account_id = "01C8D5-E4EA95-F2D624" -> null
      - etag               = "BwYvbP7DfIA=" -> null
      - id                 = "01C8D5-E4EA95-F2D624/roles/billing.user/serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member             = "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role               = "roles/billing.user" -> null
    }

  # google_billing_account_iam_member.default["sa_net_costs_manager"] will be created
  + resource "google_billing_account_iam_member" "default" {
      + billing_account_id = "01C8D5-E4EA95-F2D624"
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + role               = "roles/billing.costsManager"
    }

  # google_billing_account_iam_member.default["sa_pf_billing"] must be replaced
-/+ resource "google_billing_account_iam_member" "default" {
      ~ etag               = "BwYvbP7DfIA=" -> (known after apply)
      ~ id                 = "01C8D5-E4EA95-F2D624/roles/billing.user/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> (known after apply)
      ~ member             = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.default["sa_pf_costs_manager"] must be replaced
-/+ resource "google_billing_account_iam_member" "default" {
      ~ etag               = "BwYvbP7DfIA=" -> (known after apply)
      ~ id                 = "01C8D5-E4EA95-F2D624/roles/billing.costsManager/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> (known after apply)
      ~ member             = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.default["sa_sec_costs_manager"] will be created
  + resource "google_billing_account_iam_member" "default" {
      + billing_account_id = "01C8D5-E4EA95-F2D624"
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + role               = "roles/billing.costsManager"
    }

  # google_storage_bucket_object.providers["2-project-factory"] will be updated in-place
  ~ resource "google_storage_bucket_object" "providers" {
      ~ content             = (sensitive value)
      ~ crc32c              = "AGoRBQ==" -> (known after apply)
      ~ detect_md5hash      = "yHRPfTXK0DyjwHLyhTvAHw==" -> "different hash"
      ~ generation          = 1739891413251762 -> (known after apply)
        id                  = "ten21-prod-iac-core-outputs-0-providers/2-project-factory-providers.tf"
      ~ md5hash             = "yHRPfTXK0DyjwHLyhTvAHw==" -> (known after apply)
        name                = "providers/2-project-factory-providers.tf"
        # (14 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["2-project-factory-r"] will be updated in-place
  ~ resource "google_storage_bucket_object" "providers" {
      ~ content             = (sensitive value)
      ~ crc32c              = "yFiTqQ==" -> (known after apply)
      ~ detect_md5hash      = "R7R5mup9daTE1NGi1dow9w==" -> "different hash"
      ~ generation          = 1739891413548678 -> (known after apply)
        id                  = "ten21-prod-iac-core-outputs-0-providers/2-project-factory-r-providers.tf"
      ~ md5hash             = "R7R5mup9daTE1NGi1dow9w==" -> (known after apply)
        name                = "providers/2-project-factory-r-providers.tf"
        # (14 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-dev"] will be destroyed
  # (because key ["3-project-factory-dev"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "xVy/Lw==" -> null
      - detect_md5hash      = "mTvqabcTQc5o1NnZis5ipQ==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891413458326 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-dev-providers.tf" -> null
      - md5hash             = "mTvqabcTQc5o1NnZis5ipQ==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-providers.tf?generation=1739891413458326&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-dev-providers.tf" -> null
      - output_name         = "providers/3-project-factory-dev-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-dev-r"] will be destroyed
  # (because key ["3-project-factory-dev-r"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "vrw3tw==" -> null
      - detect_md5hash      = "sCMvi4OnPZnErZkH2CGm6Q==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891413465152 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-dev-r-providers.tf" -> null
      - md5hash             = "sCMvi4OnPZnErZkH2CGm6Q==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-r-providers.tf?generation=1739891413465152&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-dev-r-providers.tf" -> null
      - output_name         = "providers/3-project-factory-dev-r-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-r-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-prod"] will be destroyed
  # (because key ["3-project-factory-prod"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "rF/MEQ==" -> null
      - detect_md5hash      = "nyNyvD1Kq+SoQ8QB5q3jkg==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891413533989 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-prod-providers.tf" -> null
      - md5hash             = "nyNyvD1Kq+SoQ8QB5q3jkg==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-providers.tf?generation=1739891413533989&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-prod-providers.tf" -> null
      - output_name         = "providers/3-project-factory-prod-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-prod-r"] will be destroyed
  # (because key ["3-project-factory-prod-r"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "EMYj4Q==" -> null
      - detect_md5hash      = "VZ3gEgLbI700wgBh8/p2+g==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891412959300 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-prod-r-providers.tf" -> null
      - md5hash             = "VZ3gEgLbI700wgBh8/p2+g==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-r-providers.tf?generation=1739891412959300&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-prod-r-providers.tf" -> null
      - output_name         = "providers/3-project-factory-prod-r-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-r-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.tfvars will be updated in-place
  ~ resource "google_storage_bucket_object" "tfvars" {
      ~ content             = (sensitive value)
      ~ detect_md5hash      = "cJ75A/MkFgbKZ/KTvuWq5Q==" -> "different hash"
        id                  = "ten21-prod-iac-core-outputs-0-tfvars/1-resman.auto.tfvars.json"
        name                = "tfvars/1-resman.auto.tfvars.json"
        # (17 unchanged attributes hidden)
    }

  # local_file.providers["1-resman-folder-sandbox"] will be destroyed
  # (because key ["1-resman-folder-sandbox"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-sbox-0"
                impersonate_service_account = "ten21-dev-resman-sbox-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-sbox-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-sbox-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for sandbox
        EOT -> null
      - content_base64sha256 = "+6XYC77fBXbbxkSZCanc3mb4nzQthABF5Ytr8C5rm14=" -> null
      - content_base64sha512 = "hJB5xyL6jxT3BKYFAazQ9EYWKASR36e5E5Z3y43OYDoSJr9k22zZjYyiWd8gTt31ss3WlKc6wejlarvoWuMA2g==" -> null
      - content_md5          = "3c4dfec822a3dc19f55f090ac3e02b4a" -> null
      - content_sha1         = "5562cad6a7a4edd956fe67543dcbc0168ed328d1" -> null
      - content_sha256       = "fba5d80bbedf0576dbc6449909a9dcde66f89f342d840045e58b6bf02e6b9b5e" -> null
      - content_sha512       = "849079c722fa8f14f704a60501acd0f44616280491dfa7b9139677cb8dce603a1226bf64db6cd98d8ca259df204eddf5b2cdd694a73ac1e8e56abbe85ae300da" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/1-resman-folder-sandbox-providers.tf" -> null
      - id                   = "5562cad6a7a4edd956fe67543dcbc0168ed328d1" -> null
    }

  # local_file.providers["2-networking"] will be destroyed
  # (because key ["2-networking"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-net-0"
                impersonate_service_account = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for networking
        EOT -> null
      - content_base64sha256 = "LjRp7g38drpERqiSHadyuVr8hi62LTVYjUGPTFgSX24=" -> null
      - content_base64sha512 = "kQFkP9681WGehZf/eoRwOvaDcJVnYudq0v1Z1cOveDCpTXcr94hqFD6m2fDgpc28yNOLg4zB0l7Y4a+H6P4TQg==" -> null
      - content_md5          = "d38a0396bcf5773cde58d008453eb94c" -> null
      - content_sha1         = "be39c7a7b2c175975f36b857fec367307770bae0" -> null
      - content_sha256       = "2e3469ee0dfc76ba4446a8921da772b95afc862eb62d35588d418f4c58125f6e" -> null
      - content_sha512       = "9101643fdebcd5619e8597ff7a84703af68370956762e76ad2fd59d5c3af7830a94d772bf7886a143ea6d9f0e0a5cdbcc8d38b838cc1d25ed8e1af87e8fe1342" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-networking-providers.tf" -> null
      - id                   = "be39c7a7b2c175975f36b857fec367307770bae0" -> null
    }

  # local_file.providers["2-networking-r"] will be destroyed
  # (because key ["2-networking-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-net-0"
                impersonate_service_account = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for networking
        EOT -> null
      - content_base64sha256 = "Ud5zmHCsoTRLPNWJQvnpbBSWV7WmXURPsLuptFHsngQ=" -> null
      - content_base64sha512 = "rZr3Yk23NJMEg+JdIo6TFPD2EZZqziEArdc8Qqcb9OZkx1pUnEpMrD1Z21odIBBzFY9iNbsHon10LCzmz5vukg==" -> null
      - content_md5          = "a98c79340e4856fc0103df53134d8847" -> null
      - content_sha1         = "096b3c0b93431efe4be41954f3a9740a4546b83f" -> null
      - content_sha256       = "51de739870aca1344b3cd58942f9e96c149657b5a65d444fb0bba9b451ec9e04" -> null
      - content_sha512       = "ad9af7624db734930483e25d228e9314f0f611966ace2100add73c42a71bf4e664c75a549c4a4cac3d59db5a1d201073158f6235bb07a27d742c2ce6cf9bee92" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-networking-r-providers.tf" -> null
      - id                   = "096b3c0b93431efe4be41954f3a9740a4546b83f" -> null
    }

  # local_file.providers["2-project-factory"] will be destroyed
  # (because key ["2-project-factory"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-resman-pf-0"
                impersonate_service_account = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for project_factory
        EOT -> null
      - content_base64sha256 = "RKxGxWeussfpbPjqwsxKnnI0Zd95AZNc6Vd33IGmvfs=" -> null
      - content_base64sha512 = "XvszL7wEY1BvkmZYkPFz8e6zMsqniC5v4DLF962wtcdrFc3RGeE47kKrB04UR2GyOfe0H+CNSsfrAngBVotxFA==" -> null
      - content_md5          = "c8744f7d35cad03ca3c072f2853bc01f" -> null
      - content_sha1         = "81e8f48d05a7ecc9429afd668001aedd3a130169" -> null
      - content_sha256       = "44ac46c567aeb2c7e96cf8eac2cc4a9e723465df7901935ce95777dc81a6bdfb" -> null
      - content_sha512       = "5efb332fbc0463506f92665890f173f1eeb332caa7882e6fe032c5f7adb0b5c76b15cdd119e138ee42ab074e144761b239f7b41fe08d4ac7eb027801568b7114" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-project-factory-providers.tf" -> null
      - id                   = "81e8f48d05a7ecc9429afd668001aedd3a130169" -> null
    }

  # local_file.providers["2-project-factory-r"] will be destroyed
  # (because key ["2-project-factory-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-resman-pf-0"
                impersonate_service_account = "ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for project_factory
        EOT -> null
      - content_base64sha256 = "LIB9W6Qr6LNc4w0GCz9HobokmpOIQNt5fQ3D6VNST3U=" -> null
      - content_base64sha512 = "WAXt4wix04lTaITLIZEk5CnBIbvf10V2NCKohw63X9PZEOQTVtGOQo/ySP+jsc46nWw+ZNZu4INuTHp8QTj2yg==" -> null
      - content_md5          = "47b4799aea7d75a4c4d4d1a2d5da30f7" -> null
      - content_sha1         = "73a28e8ace5d962f3e13cdea99e91e051f39dbd6" -> null
      - content_sha256       = "2c807d5ba42be8b35ce30d060b3f47a1ba249a938840db797d0dc3e953524f75" -> null
      - content_sha512       = "5805ede308b1d389536884cb219124e429c121bbdfd745763422a8870eb75fd3d910e41356d18e428ff248ffa3b1ce3a9d6c3e64d66ee0836e4c7a7c4138f6ca" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-project-factory-r-providers.tf" -> null
      - id                   = "73a28e8ace5d962f3e13cdea99e91e051f39dbd6" -> null
    }

  # local_file.providers["2-security"] will be destroyed
  # (because key ["2-security"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-sec-0"
                impersonate_service_account = "ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for security
        EOT -> null
      - content_base64sha256 = "esA+j41/trOSQfdLpW6VOg5qoXdQAEjX9gc2/+CCqP8=" -> null
      - content_base64sha512 = "jD5wEcgFA5iLJ5yN+2kVrz1Hgu4fsm1ME8EUG1KTHrp9W7ilt6WCN31LrYU9eZ7L/IQgaO4EtDAi074BtIwxnQ==" -> null
      - content_md5          = "c2fbbde4976c5f0633829a4f0c3e8865" -> null
      - content_sha1         = "208d5530d6b28534f96dd9199272309a38a7b246" -> null
      - content_sha256       = "7ac03e8f8d7fb6b39241f74ba56e953a0e6aa177500048d7f60736ffe082a8ff" -> null
      - content_sha512       = "8c3e7011c80503988b279c8dfb6915af3d4782ee1fb26d4c13c1141b52931eba7d5bb8a5b7a582377d4bad853d799ecbfc842068ee04b43022d3be01b48c319d" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-security-providers.tf" -> null
      - id                   = "208d5530d6b28534f96dd9199272309a38a7b246" -> null
    }

  # local_file.providers["2-security-r"] will be destroyed
  # (because key ["2-security-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-sec-0"
                impersonate_service_account = "ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for security
        EOT -> null
      - content_base64sha256 = "ysOOCMWzvlX69nwwja6GBxJMzAbsECIso5z+GcLhYcM=" -> null
      - content_base64sha512 = "/QepWs7i/TAEp8xfmimBhMNn0aadKJx0BmajEdi8y4170X5wRfQW+oezB8MTQAnIbObiosabxjeYUzyWoV+ORw==" -> null
      - content_md5          = "03a8f4563bf51cbeab38d7b264c69c61" -> null
      - content_sha1         = "208bf1d5d351937d9f6f760ef0c7e9e9a12aa408" -> null
      - content_sha256       = "cac38e08c5b3be55faf67c308dae8607124ccc06ec10222ca39cfe19c2e161c3" -> null
      - content_sha512       = "fd07a95acee2fd3004a7cc5f9a298184c367d1a69d289c740666a311d8bccb8d7bd17e7045f416fa87b307c3134009c86ce6e2a2c69bc63798533c96a15f8e47" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-security-r-providers.tf" -> null
      - id                   = "208bf1d5d351937d9f6f760ef0c7e9e9a12aa408" -> null
    }

  # local_file.providers["3-gcve-dev"] will be destroyed
  # (because key ["3-gcve-dev"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-gcve-0"
                impersonate_service_account = "ten21-dev-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gcve-dev
        EOT -> null
      - content_base64sha256 = "1jwHDH3pd8SX2pFQ9jX2M0I5l10teX2sRZJQoQqRkL8=" -> null
      - content_base64sha512 = "S/yPxQh0zlRcCo3qBH7V+qsuwSTFSrjyfVVxRg9mqFaVrCRVs5uTZeKSRk0t+UFH6BIG/lr0AxBvydQqyp6v6A==" -> null
      - content_md5          = "64548631245d82c05bea883556a9afe8" -> null
      - content_sha1         = "d7385dd2adced1d647cdf77f31d0d741db4122c1" -> null
      - content_sha256       = "d63c070c7de977c497da9150f635f6334239975d2d797dac459250a10a9190bf" -> null
      - content_sha512       = "4bfc8fc50874ce545c0a8dea047ed5faab2ec124c54ab8f27d5571460f66a85695ac2455b39b9365e292464d2df94147e81206fe5af403106fc9d42aca9eafe8" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gcve-dev-providers.tf" -> null
      - id                   = "d7385dd2adced1d647cdf77f31d0d741db4122c1" -> null
    }

  # local_file.providers["3-gcve-dev-r"] will be destroyed
  # (because key ["3-gcve-dev-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-gcve-0"
                impersonate_service_account = "ten21-dev-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gcve-dev
        EOT -> null
      - content_base64sha256 = "52pA4CqoFKDbvWhX2qPBXsafo+CQyk1KyQhGqiEQGos=" -> null
      - content_base64sha512 = "gaDAR1O98quPHS6ozzYnajoU/dredl5nMmbM2eq/+rq2EX7mPljeS4tqisFykkVht97Ff2/pECIrbITOCoj63w==" -> null
      - content_md5          = "daaca044e77863eb8c59d579d3e19448" -> null
      - content_sha1         = "1052d2154c3a4185e4d1bd30d6a0bccd8c3d6dce" -> null
      - content_sha256       = "e76a40e02aa814a0dbbd6857daa3c15ec69fa3e090ca4d4ac90846aa21101a8b" -> null
      - content_sha512       = "81a0c04753bdf2ab8f1d2ea8cf36276a3a14fddade765e673266ccd9eabffabab6117ee63e58de4b8b6a8ac172924561b7dec57f6fe910222b6c84ce0a88fadf" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gcve-dev-r-providers.tf" -> null
      - id                   = "1052d2154c3a4185e4d1bd30d6a0bccd8c3d6dce" -> null
    }

  # local_file.providers["3-gcve-prod"] will be destroyed
  # (because key ["3-gcve-prod"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-gcve-0"
                impersonate_service_account = "ten21-prod-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gcve-prod
        EOT -> null
      - content_base64sha256 = "z1AeKIdTscaaJCS3wO1xtm/EAwOORIEErzYA/P4GeHY=" -> null
      - content_base64sha512 = "JW/g6dPsmOqVOx0QwJU/maqUMWIRh2MVMtMTQltQSIq+iBR7u3/piOdaiBSL+FceFyn8wER/lReeKV1RMYyViA==" -> null
      - content_md5          = "ae347ae6849f656dfeb4dce7188c524c" -> null
      - content_sha1         = "4917f3908a0a330f8e8c3b4d3ffb6693de75de40" -> null
      - content_sha256       = "cf501e288753b1c69a2424b7c0ed71b66fc403038e448104af3600fcfe067876" -> null
      - content_sha512       = "256fe0e9d3ec98ea953b1d10c0953f99aa9431621187631532d313425b50488abe88147bbb7fe988e75a88148bf8571e1729fcc0447f95179e295d51318c9588" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gcve-prod-providers.tf" -> null
      - id                   = "4917f3908a0a330f8e8c3b4d3ffb6693de75de40" -> null
    }

  # local_file.providers["3-gcve-prod-r"] will be destroyed
  # (because key ["3-gcve-prod-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-gcve-0"
                impersonate_service_account = "ten21-prod-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gcve-prod
        EOT -> null
      - content_base64sha256 = "C3I4SF4X5OV6Vkk8bYrSrW0xl5mM7Uf/vMzLJAWLxqk=" -> null
      - content_base64sha512 = "rOs9P4nNoddo6DEYKZqBy4p5w+eCOP+Svbg6QMYO2Y5JtxBehgeIqVG413KqZvG8gwQv9VogoouN5JGMxUwY1w==" -> null
      - content_md5          = "5adca79e9ccf6bbe0e71da60fbf00c77" -> null
      - content_sha1         = "cb1dc36c193b670af69a1442db68f365ca51d815" -> null
      - content_sha256       = "0b7238485e17e4e57a56493c6d8ad2ad6d3197998ced47ffbccccb24058bc6a9" -> null
      - content_sha512       = "aceb3d3f89cda1d768e83118299a81cb8a79c3e78238ff92bdb83a40c60ed98e49b7105e860788a951b8d772aa66f1bc83042ff55a20a28b8de4918cc54c18d7" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gcve-prod-r-providers.tf" -> null
      - id                   = "cb1dc36c193b670af69a1442db68f365ca51d815" -> null
    }

  # local_file.providers["3-gke-dev"] will be destroyed
  # (because key ["3-gke-dev"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-gke-0"
                impersonate_service_account = "ten21-dev-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gke-dev
        EOT -> null
      - content_base64sha256 = "5vMGkJv3XDCTdrSU4DrfafQzx2K57fuRmOhBj9B/c4w=" -> null
      - content_base64sha512 = "NIleTJAwqLfXJC2nHuVhFRtar+qyYecrOMKzC88vI3HDwQ+R0XG8AdWRJdFJkFvlpbY1wgRo7Fe/kyfs3Tsygg==" -> null
      - content_md5          = "d9c0aca3a4e5db65ba1ff6840266087f" -> null
      - content_sha1         = "4a556c9197519192d812bebedb5a460c63583baa" -> null
      - content_sha256       = "e6f306909bf75c309376b494e03adf69f433c762b9edfb9198e8418fd07f738c" -> null
      - content_sha512       = "34895e4c9030a8b7d7242da71ee561151b5aafeab261e72b38c2b30bcf2f2371c3c10f91d171bc01d59125d149905be5a5b635c20468ec57bf9327ecdd3b3282" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gke-dev-providers.tf" -> null
      - id                   = "4a556c9197519192d812bebedb5a460c63583baa" -> null
    }

  # local_file.providers["3-gke-dev-r"] will be destroyed
  # (because key ["3-gke-dev-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-gke-0"
                impersonate_service_account = "ten21-dev-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gke-dev
        EOT -> null
      - content_base64sha256 = "DGaNaxb7Z9B24rROLivpbEuAaytuHRDUySP/64mmY1o=" -> null
      - content_base64sha512 = "aCs6v58Hvok9g58nhpeauHmRm70eLVK3j4vY70317j3Tywd5644gz0BcnHjTBzctOvaiVoiONYqa0GOa9J08kw==" -> null
      - content_md5          = "3f1605d77249e5f556969ea442448ea4" -> null
      - content_sha1         = "1ee4cfd48a6abaf016c9687b54abc8dfb8774e39" -> null
      - content_sha256       = "0c668d6b16fb67d076e2b44e2e2be96c4b806b2b6e1d10d4c923ffeb89a6635a" -> null
      - content_sha512       = "682b3abf9f07be893d839f2786979ab879919bbd1e2d52b78f8bd8ef4df5ee3dd3cb0779eb8e20cf405c9c78d307372d3af6a256888e358a9ad0639af49d3c93" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gke-dev-r-providers.tf" -> null
      - id                   = "1ee4cfd48a6abaf016c9687b54abc8dfb8774e39" -> null
    }

  # local_file.providers["3-gke-prod"] will be destroyed
  # (because key ["3-gke-prod"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-gke-0"
                impersonate_service_account = "ten21-prod-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gke-prod
        EOT -> null
      - content_base64sha256 = "n0d7ZIZN7smKWe5P94TC+PZEggqlXmRx386c01YuNWk=" -> null
      - content_base64sha512 = "CisXGBU+TkcFwXXBbeQfukBNP5VQIkdasi/C6qbLXCbRvnCdiGk1siDIWtGMjw6CwAu64f00uOocE103y5rMTA==" -> null
      - content_md5          = "4c1ffd701f0b04fe39d2b849d83c2d00" -> null
      - content_sha1         = "62351c8804a182a2c2bc95aefd8aef355fdb750b" -> null
      - content_sha256       = "9f477b64864deec98a59ee4ff784c2f8f644820aa55e6471dfce9cd3562e3569" -> null
      - content_sha512       = "0a2b1718153e4e4705c175c16de41fba404d3f955022475ab22fc2eaa6cb5c26d1be709d886935b220c85ad18c8f0e82c00bbae1fd34b8ea1c135d37cb9acc4c" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gke-prod-providers.tf" -> null
      - id                   = "62351c8804a182a2c2bc95aefd8aef355fdb750b" -> null
    }

  # local_file.providers["3-gke-prod-r"] will be destroyed
  # (because key ["3-gke-prod-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-gke-0"
                impersonate_service_account = "ten21-prod-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for gke-prod
        EOT -> null
      - content_base64sha256 = "4GtI4DoPvjUyqEYRQ+9Ht0lGBNtQ6Q8pKUQKVL4FjVI=" -> null
      - content_base64sha512 = "s1bU32RgMWQ6jL9D5cmc97vi/hokYMZZzzDTrXEHKCJWlF2CSlzG4kWpfmQFtq3b6cKa1tyugHWz1B/w9fGCcg==" -> null
      - content_md5          = "d580d83f8b7e4eac5bb769751ace7a41" -> null
      - content_sha1         = "83fc6a8c7b30455edb7717242fc6b48fc9350a57" -> null
      - content_sha256       = "e06b48e03a0fbe3532a8461143ef47b7494604db50e90f2929440a54be058d52" -> null
      - content_sha512       = "b356d4df646031643a8cbf43e5c99cf7bbe2fe1a2460c659cf30d3ad7107282256945d824a5cc6e245a97e6405b6addbe9c29ad6dcae8075b3d41ff0f5f18272" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-gke-prod-r-providers.tf" -> null
      - id                   = "83fc6a8c7b30455edb7717242fc6b48fc9350a57" -> null
    }

  # local_file.providers["3-project-factory-dev"] will be destroyed
  # (because key ["3-project-factory-dev"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-pf-0"
                impersonate_service_account = "ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for project-factory-dev
        EOT -> null
      - content_base64sha256 = "IzMzZ4bSZJ7dl0PFWGYfTgZtVKngFyrX9HMPChZURFg=" -> null
      - content_base64sha512 = "KWYRLWSWhqJgQJeKQb/T26dBC3+D1k+60wbDRakXgfukq2D3fEXOg6RWQnklkcD6TSzaVmOJOm/72LnlL04DJQ==" -> null
      - content_md5          = "993bea69b71341ce68d4d9d98ace62a5" -> null
      - content_sha1         = "9832dea432f1e0113994df9b762d95bb4d331dc0" -> null
      - content_sha256       = "2333336786d2649edd9743c558661f4e066d54a9e0172ad7f4730f0a16544458" -> null
      - content_sha512       = "2966112d649686a26040978a41bfd3dba7410b7f83d64fbad306c345a91781fba4ab60f77c45ce83a45642792591c0fa4d2cda5663893a6ffbd8b9e52f4e0325" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-project-factory-dev-providers.tf" -> null
      - id                   = "9832dea432f1e0113994df9b762d95bb4d331dc0" -> null
    }

  # local_file.providers["3-project-factory-dev-r"] will be destroyed
  # (because key ["3-project-factory-dev-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-pf-0"
                impersonate_service_account = "ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for project-factory-dev
        EOT -> null
      - content_base64sha256 = "BosLgKVVAzgEXoHW1Z+5rHA/VzpJER8DoPNPhb/Ej8w=" -> null
      - content_base64sha512 = "RtW8xXEj0JpZu+p3UrTePGZV0WNUARGuKeejpw0aTzZmcLjD5a8UycwY+xE+FzFDITj7tAZ/05BVJbEXD7Afrw==" -> null
      - content_md5          = "b0232f8b83a73d99c4ad9907d821a6e9" -> null
      - content_sha1         = "e4f313cd747df335497614addc80d090136d6cf0" -> null
      - content_sha256       = "068b0b80a5550338045e81d6d59fb9ac703f573a49111f03a0f34f85bfc48fcc" -> null
      - content_sha512       = "46d5bcc57123d09a59bbea7752b4de3c6655d163540111ae29e7a3a70d1a4f366670b8c3e5af14c9cc18fb113e1731432138fbb4067fd3905525b1170fb01faf" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-project-factory-dev-r-providers.tf" -> null
      - id                   = "e4f313cd747df335497614addc80d090136d6cf0" -> null
    }

  # local_file.providers["3-project-factory-prod"] will be destroyed
  # (because key ["3-project-factory-prod"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-pf-0"
                impersonate_service_account = "ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for project-factory-prod
        EOT -> null
      - content_base64sha256 = "0E1bnvF7AZg+b+Qnf598QD1Kd4rcSP8HQzcM6gOkgYA=" -> null
      - content_base64sha512 = "2D2c4unfa+uLJL+uaLTyZDZJGcQsPVjLX+DD6vg4dS4tp5DrJypDCGz+wuSdQrQAtvZsz1uXPpDestSaMNPOAw==" -> null
      - content_md5          = "9f2372bc3d4aabe4a843c401e6ade392" -> null
      - content_sha1         = "c792029e7ac9c30cab19cbb859556ac2ce247004" -> null
      - content_sha256       = "d04d5b9ef17b01983e6fe4277f9f7c403d4a778adc48ff0743370cea03a48180" -> null
      - content_sha512       = "d83d9ce2e9df6beb8b24bfae68b4f264364919c42c3d58cb5fe0c3eaf838752e2da790eb272a43086cfec2e49d42b400b6f66ccf5b973e90deb2d49a30d3ce03" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-project-factory-prod-providers.tf" -> null
      - id                   = "c792029e7ac9c30cab19cbb859556ac2ce247004" -> null
    }

  # local_file.providers["3-project-factory-prod-r"] will be destroyed
  # (because key ["3-project-factory-prod-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-pf-0"
                impersonate_service_account = "ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for project-factory-prod
        EOT -> null
      - content_base64sha256 = "RoyqMGpHnhKLlQxMllTnzdZtUwXlDTkktoNzdBF4Zl8=" -> null
      - content_base64sha512 = "JdFAEzHvjL3YCl6T1gut2Ni5QzdZNujQRQY6P+rxtzoQObMH0KPzqIv1V+SXKhAhsTujYbPX+8kdawcGfM5DcQ==" -> null
      - content_md5          = "559de01202db23bd34c20061f3fa76fa" -> null
      - content_sha1         = "894248eed33c73f6a0186ca37a8081a4977ed805" -> null
      - content_sha256       = "468caa306a479e128b950c4c9654e7cdd66d5305e50d3924b68373741178665f" -> null
      - content_sha512       = "25d1401331ef8cbdd80a5e93d60badd8d8b943375936e8d045063a3feaf1b73a1039b307d0a3f3a88bf557e4972a1021b13ba361b3d7fbc91d6b07067cce4371" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/3-project-factory-prod-r-providers.tf" -> null
      - id                   = "894248eed33c73f6a0186ca37a8081a4977ed805" -> null
    }

  # local_file.tfvars["1"] will be destroyed
  # (because key ["1"] is not in for_each map)
  - resource "local_file" "tfvars" {
      - content              = jsonencode(
            {
              - folder_ids       = {
                  - gcve            = "folders/274116401743"
                  - gcve-dev        = "folders/823384691612"
                  - gcve-prod       = "folders/859602608396"
                  - gke             = "folders/687148559440"
                  - gke-dev         = "folders/87609112015"
                  - gke-prod        = "folders/1078051452326"
                  - networking      = "folders/613695972665"
                  - networking-dev  = "folders/164559451269"
                  - networking-prod = "folders/1024624119124"
                  - sandbox         = "folders/182574607091"
                  - security        = "folders/400949762104"
                  - teams           = "folders/379949197155"
                }
              - service_accounts = {
                  - gcve-dev               = "ten21-dev-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - gcve-dev-r             = "ten21-dev-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - gcve-prod              = "ten21-prod-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - gcve-prod-r            = "ten21-prod-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - gke-dev                = "ten21-dev-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - gke-dev-r              = "ten21-dev-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - gke-prod               = "ten21-prod-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - gke-prod-r             = "ten21-prod-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - networking             = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - networking-r           = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - project-factory        = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - project-factory-dev    = "ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - project-factory-dev-r  = "ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - project-factory-prod   = "ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - project-factory-prod-r = "ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - project-factory-r      = "ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - sandbox                = "ten21-dev-resman-sbox-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - security               = "ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  - security-r             = "ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                }
              - stage_config     = {
                  - gcve-dev             = {
                      - environment = "dev"
                      - short_name  = "gcve"
                    }
                  - gcve-prod            = {
                      - environment = "prod"
                      - short_name  = "gcve"
                    }
                  - gke-dev              = {
                      - environment = "dev"
                      - short_name  = "gke"
                    }
                  - gke-prod             = {
                      - environment = "prod"
                      - short_name  = "gke"
                    }
                  - networking           = {
                      - iam_delegated_principals = {
                          - dev  = [
                              - "serviceAccount:ten21-dev-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                              - "serviceAccount:ten21-dev-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                              - "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                          - prod = [
                              - "serviceAccount:ten21-prod-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                              - "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                        }
                      - iam_viewer_principals    = {
                          - dev  = [
                              - "serviceAccount:ten21-dev-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                              - "serviceAccount:ten21-dev-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                              - "serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                          - prod = [
                              - "serviceAccount:ten21-prod-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                              - "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                        }
                      - short_name               = "net"
                    }
                  - project-factory-dev  = {
                      - environment = "dev"
                      - short_name  = "pf"
                    }
                  - project-factory-prod = {
                      - environment = "prod"
                      - short_name  = "pf"
                    }
                  - project_factory      = {
                      - iam_delegated_principals = {
                          - dev  = []
                          - prod = []
                        }
                      - iam_viewer_principals    = {
                          - dev  = []
                          - prod = []
                        }
                      - short_name               = "pf"
                    }
                  - security             = {
                      - iam_delegated_principals = {
                          - dev  = [
                              - "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                          - prod = [
                              - "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                        }
                      - iam_viewer_principals    = {
                          - dev  = [
                              - "serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                          - prod = [
                              - "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
                            ]
                        }
                      - short_name               = "sec"
                    }
                }
              - tag_keys         = {
                  - context     = "tagKeys/281483044549536"
                  - environment = "tagKeys/281483883057178"
                }
              - tag_names        = {
                  - context     = "context"
                  - environment = "environment"
                }
              - tag_values       = {
                  - "context/gcve"            = "tagValues/281478167948246"
                  - "context/gke"             = "tagValues/281477566097651"
                  - "context/networking"      = "tagValues/281481730502710"
                  - "context/project-factory" = "tagValues/281482780497338"
                  - "context/sandbox"         = "tagValues/281479757838417"
                  - "context/security"        = "tagValues/281481940685572"
                  - "environment/development" = "tagValues/281476507938981"
                  - "environment/production"  = "tagValues/281483010995173"
                }
            }
        ) -> null
      - content_base64sha256 = "lUSz2hhMo+wSoRmbtR8uZuM7IKo/Er6GIDbu5sbuWqU=" -> null
      - content_base64sha512 = "acrLQwsP3SU5hfxlYDB7NtocwRGhjq9ntP6tSV1SMgrvXc48baRJ/5l6W6j4uB2vVtrMt0rIm9Vf7EHLTdxtIA==" -> null
      - content_md5          = "709ef903f3241606ca67f293bee5aae5" -> null
      - content_sha1         = "b1c3b44d0865738784cb03feeaece6e3ba2198fd" -> null
      - content_sha256       = "9544b3da184ca3ec12a1199bb51f2e66e33b20aa3f12be862036eee6c6ee5aa5" -> null
      - content_sha512       = "69cacb430b0fdd253985fc6560307b36da1cc111a18eaf67b4fead495d52320aef5dce3c6da449ff997a5ba8f8b81daf56daccb74ac89bd55fec41cb4ddc6d20" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/tfvars/1-resman.auto.tfvars.json" -> null
      - id                   = "b1c3b44d0865738784cb03feeaece6e3ba2198fd" -> null
    }

  # module.net-bucket[0].google_storage_bucket.bucket[0] will be destroyed
  # (because google_storage_bucket.bucket is not in configuration)
  - resource "google_storage_bucket" "bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "ten21-prod-resman-net-0" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "ten21-prod-resman-net-0" -> null
      - project                     = "ten21-prod-iac-core-0" -> null
      - project_number              = 417203162051 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/ten21-prod-resman-net-0" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://ten21-prod-resman-net-0" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-02-18T14:56:19.149Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.net-bucket[0].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be destroyed
  # (because google_storage_bucket_iam_binding.authoritative is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-prod-resman-net-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-prod-resman-net-0/roles/storage.objectAdmin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.net-bucket[0].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be destroyed
  # (because google_storage_bucket_iam_binding.authoritative is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-prod-resman-net-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-prod-resman-net-0/roles/storage.objectViewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectViewer" -> null
    }

  # module.net-folder[0].google_folder.folder[0] will be destroyed
  # (because google_folder.folder is not in configuration)
  - resource "google_folder" "folder" {
      - create_time         = "2025-02-18T15:11:55.487Z" -> null
      - deletion_protection = false -> null
      - display_name        = "Networking" -> null
      - folder_id           = "613695972665" -> null
      - id                  = "folders/613695972665" -> null
      - lifecycle_state     = "ACTIVE" -> null
      - name                = "folders/613695972665" -> null
      - parent              = "organizations/350989124418" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["organizations/350989124418/roles/projectIamViewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/organizations/350989124418/roles/projectIamViewer" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "organizations/350989124418/roles/projectIamViewer" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["organizations/350989124418/roles/serviceProjectNetworkAdmin"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/organizations/350989124418/roles/serviceProjectNetworkAdmin" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "organizations/350989124418/roles/serviceProjectNetworkAdmin" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/compute.networkViewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/compute.networkViewer" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/compute.networkViewer" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/compute.xpnAdmin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/compute.xpnAdmin" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/editor"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/editor" -> null
      - members = [
          - "group:gcp-vpc-network-admins@tentwentyone.io",
        ] -> null
      - role    = "roles/editor" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/logging.admin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/logging.admin" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/owner"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/owner" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/owner" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/resourcemanager.folderAdmin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.folderAdmin" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderViewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/resourcemanager.folderViewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.folderViewer" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/resourcemanager.projectCreator" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.projectCreator" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.tagUser"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/resourcemanager.tagUser" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.tagUser" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.tagViewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/resourcemanager.tagViewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.tagViewer" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/serviceusage.serviceUsageAdmin"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/serviceusage.serviceUsageAdmin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/serviceusage.serviceUsageAdmin" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/serviceusage.serviceUsageConsumer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.authoritative["roles/viewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/viewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/viewer" -> null
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["organizations/350989124418/roles/gcveNetworkAdmin:development"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/organizations/350989124418/roles/gcveNetworkAdmin/stage 3 development//resource.matchTag(
              '350989124418/environment',
              'development'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-dev-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "organizations/350989124418/roles/gcveNetworkAdmin" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'development'
                )
            EOT -> null
          - title       = "stage 3 development" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["organizations/350989124418/roles/gcveNetworkAdmin:production"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/organizations/350989124418/roles/gcveNetworkAdmin/stage 3 production//resource.matchTag(
              '350989124418/environment',
              'production'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-gcve-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "organizations/350989124418/roles/gcveNetworkAdmin" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'production'
                )
            EOT -> null
          - title       = "stage 3 production" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["organizations/350989124418/roles/gcveNetworkViewer:development"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/organizations/350989124418/roles/gcveNetworkViewer/stage 3 development//resource.matchTag(
              '350989124418/environment',
              'development'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-dev-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "organizations/350989124418/roles/gcveNetworkViewer" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'development'
                )
            EOT -> null
          - title       = "stage 3 development" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["organizations/350989124418/roles/gcveNetworkViewer:production"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/organizations/350989124418/roles/gcveNetworkViewer/stage 3 production//resource.matchTag(
              '350989124418/environment',
              'production'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-gcve-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "organizations/350989124418/roles/gcveNetworkViewer" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'production'
                )
            EOT -> null
          - title       = "stage 3 production" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["pf_delegated_grant"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = "folders/613695972665/roles/resourcemanager.projectIamAdmin/project factory project delegated admin/Project factory delegated grant./api.getAttribute('iam.googleapis.com/modifiedGrantsByRole', []).hasOnly(['roles/compute.networkUser', 'roles/composer.sharedVpcAgent', 'roles/container.hostServiceAgentUser', 'roles/vpcaccess.user'])" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.projectIamAdmin" -> null

      - condition {
          - description = "Project factory delegated grant." -> null
          - expression  = "api.getAttribute('iam.googleapis.com/modifiedGrantsByRole', []).hasOnly(['roles/compute.networkUser', 'roles/composer.sharedVpcAgent', 'roles/container.hostServiceAgentUser', 'roles/vpcaccess.user'])" -> null
          - title       = "project factory project delegated admin" -> null
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["roles/dns.admin:development"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/roles/dns.admin/stage 3 development//resource.matchTag(
              '350989124418/environment',
              'development'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-dev-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/dns.admin" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'development'
                )
            EOT -> null
          - title       = "stage 3 development" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["roles/dns.admin:production"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/roles/dns.admin/stage 3 production//resource.matchTag(
              '350989124418/environment',
              'production'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-gke-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/dns.admin" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'production'
                )
            EOT -> null
          - title       = "stage 3 production" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["roles/dns.reader:development"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/roles/dns.reader/stage 3 development//resource.matchTag(
              '350989124418/environment',
              'development'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-dev-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/dns.reader" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'development'
                )
            EOT -> null
          - title       = "stage 3 development" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_folder_iam_binding.bindings["roles/dns.reader:production"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBuMBXM=" -> null
      - folder  = "folders/613695972665" -> null
      - id      = <<-EOT
            folders/613695972665/roles/dns.reader/stage 3 production//resource.matchTag(
              '350989124418/environment',
              'production'
            )
        EOT -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-gke-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/dns.reader" -> null

      - condition {
          - expression  = <<-EOT
                resource.matchTag(
                  '350989124418/environment',
                  'production'
                )
            EOT -> null
          - title       = "stage 3 production" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.net-folder[0].google_tags_tag_binding.binding["context"] will be destroyed
  # (because google_tags_tag_binding.binding is not in configuration)
  - resource "google_tags_tag_binding" "binding" {
      - id        = "tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F613695972665/tagValues/281481730502710" -> null
      - name      = "%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F613695972665/tagValues/281481730502710" -> null
      - parent    = "//cloudresourcemanager.googleapis.com/folders/613695972665" -> null
      - tag_value = "tagValues/281481730502710" -> null
    }

  # module.net-folder-envs["dev"].google_folder.folder[0] will be destroyed
  # (because google_folder.folder is not in configuration)
  - resource "google_folder" "folder" {
      - create_time         = "2025-02-18T15:15:41.770Z" -> null
      - deletion_protection = false -> null
      - display_name        = "Development" -> null
      - folder_id           = "164559451269" -> null
      - id                  = "folders/164559451269" -> null
      - lifecycle_state     = "ACTIVE" -> null
      - name                = "folders/164559451269" -> null
      - parent              = "folders/613695972665" -> null
    }

  # module.net-folder-envs["dev"].google_tags_tag_binding.binding["environment"] will be destroyed
  # (because google_tags_tag_binding.binding is not in configuration)
  - resource "google_tags_tag_binding" "binding" {
      - id        = "tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F164559451269/tagValues/281476507938981" -> null
      - name      = "%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F164559451269/tagValues/281476507938981" -> null
      - parent    = "//cloudresourcemanager.googleapis.com/folders/164559451269" -> null
      - tag_value = "tagValues/281476507938981" -> null
    }

  # module.net-folder-envs["prod"].google_folder.folder[0] will be destroyed
  # (because google_folder.folder is not in configuration)
  - resource "google_folder" "folder" {
      - create_time         = "2025-02-18T15:15:42.247Z" -> null
      - deletion_protection = false -> null
      - display_name        = "Production" -> null
      - folder_id           = "1024624119124" -> null
      - id                  = "folders/1024624119124" -> null
      - lifecycle_state     = "ACTIVE" -> null
      - name                = "folders/1024624119124" -> null
      - parent              = "folders/613695972665" -> null
    }

  # module.net-folder-envs["prod"].google_tags_tag_binding.binding["environment"] will be destroyed
  # (because google_tags_tag_binding.binding is not in configuration)
  - resource "google_tags_tag_binding" "binding" {
      - id        = "tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F1024624119124/tagValues/281483010995173" -> null
      - name      = "%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F1024624119124/tagValues/281483010995173" -> null
      - parent    = "//cloudresourcemanager.googleapis.com/folders/1024624119124" -> null
      - tag_value = "tagValues/281483010995173" -> null
    }

  # module.net-sa-ro[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.net-sa-ro[0].google_service_account.service_account[0] will be destroyed
  # (because google_service_account.service_account is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-prod-resman-net-0r" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman networking service account (read-only)." -> null
      - email        = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "117074866053761118034" -> null
        # (1 unchanged attribute hidden)
    }

  # module.net-sa-ro[0].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_service_account_iam_binding.authoritative is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.net-sa-ro[0].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be destroyed
  # (because google_storage_bucket_iam_member.bucket-roles is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/organizations/350989124418/roles/storageViewer/serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "organizations/350989124418/roles/storageViewer" -> null
    }

  # module.net-sa-rw[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.net-sa-rw[0].google_service_account.service_account[0] will be destroyed
  # (because google_service_account.service_account is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-prod-resman-net-0" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman networking service account." -> null
      - email        = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "104252597722660811703" -> null
        # (1 unchanged attribute hidden)
    }

  # module.net-sa-rw[0].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_service_account_iam_binding.authoritative is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.net-sa-rw[0].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be destroyed
  # (because google_storage_bucket_iam_member.bucket-roles is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/roles/storage.objectAdmin/serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectAdmin" -> null
    }

  # module.organization[0].google_organization_iam_member.bindings["sa_net_net_ro_ngfw_enterprise_viewer"] will be destroyed
  # (because key ["sa_net_net_ro_ngfw_enterprise_viewer"] is not in for_each map)
  - resource "google_organization_iam_member" "bindings" {
      - etag   = "BwYvbP7tlos=" -> null
      - id     = "350989124418/organizations/350989124418/roles/ngfwEnterpriseViewer/serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - org_id = "350989124418" -> null
      - role   = "organizations/350989124418/roles/ngfwEnterpriseViewer" -> null
    }

  # module.organization[0].google_organization_iam_member.bindings["sa_net_ro_ngfw_enterprise_viewer"] will be created
  + resource "google_organization_iam_member" "bindings" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + org_id = "350989124418"
      + role   = "organizations/350989124418/roles/ngfwEnterpriseViewer"
    }

  # module.organization[0].google_organization_iam_member.bindings["sa_pf_conditional_org_policy"] must be replaced
-/+ resource "google_organization_iam_member" "bindings" {
      ~ etag   = "BwYvbP7tlos=" -> (known after apply)
      ~ id     = <<-EOT
            350989124418/roles/orgpolicy.policyAdmin/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com/org_policy_tag_pf_scoped/Org policy tag scoped grant for project factory./resource.matchTag('350989124418/context', 'project-factory')
        EOT -> (known after apply)
      ~ member = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.organization[0].google_organization_iam_member.bindings["sa_sec_asset_viewer"] will be destroyed
  # (because key ["sa_sec_asset_viewer"] is not in for_each map)
  - resource "google_organization_iam_member" "bindings" {
      - etag   = "BwYvbP7tlos=" -> null
      - id     = "350989124418/roles/cloudasset.viewer/serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - org_id = "350989124418" -> null
      - role   = "roles/cloudasset.viewer" -> null
    }

  # module.organization[0].google_organization_iam_member.bindings["sa_sec_cloudasset"] will be created
  + resource "google_organization_iam_member" "bindings" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + org_id = "350989124418"
      + role   = "roles/cloudasset.viewer"
    }

  # module.organization[0].google_tags_tag_value_iam_binding.default["environment/development:roles/resourcemanager.tagUser"] will be updated in-place
  ~ resource "google_tags_tag_value_iam_binding" "default" {
        id        = "tagValues/281476507938981/roles/resourcemanager.tagUser"
      ~ members   = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
            # (2 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.organization[0].google_tags_tag_value_iam_binding.default["environment/development:roles/resourcemanager.tagViewer"] will be updated in-place
  ~ resource "google_tags_tag_value_iam_binding" "default" {
        id        = "tagValues/281476507938981/roles/resourcemanager.tagViewer"
      ~ members   = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
            # (2 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.organization[0].google_tags_tag_value_iam_binding.default["environment/production:roles/resourcemanager.tagUser"] will be updated in-place
  ~ resource "google_tags_tag_value_iam_binding" "default" {
        id        = "tagValues/281483010995173/roles/resourcemanager.tagUser"
      ~ members   = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
            # (2 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.organization[0].google_tags_tag_value_iam_binding.default["environment/production:roles/resourcemanager.tagViewer"] will be updated in-place
  ~ resource "google_tags_tag_value_iam_binding" "default" {
        id        = "tagValues/281483010995173/roles/resourcemanager.tagViewer"
      ~ members   = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
            # (2 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.pf-bucket[0].google_storage_bucket.bucket[0] will be destroyed
  # (because google_storage_bucket.bucket is not in configuration)
  - resource "google_storage_bucket" "bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "ten21-resman-pf-0" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "ten21-resman-pf-0" -> null
      - project                     = "ten21-prod-iac-core-0" -> null
      - project_number              = 417203162051 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/ten21-resman-pf-0" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://ten21-resman-pf-0" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-02-18T14:56:13.495Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.pf-bucket[0].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be destroyed
  # (because google_storage_bucket_iam_binding.authoritative is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-resman-pf-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-resman-pf-0/roles/storage.objectAdmin" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.pf-bucket[0].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be destroyed
  # (because google_storage_bucket_iam_binding.authoritative is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-resman-pf-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-resman-pf-0/roles/storage.objectViewer" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectViewer" -> null
    }

  # module.pf-sa-ro[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.pf-sa-ro[0].google_service_account.service_account[0] will be destroyed
  # (because google_service_account.service_account is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-resman-pf-0r" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman project factory main service account (read-only)." -> null
      - email        = "ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "112009137217824821694" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pf-sa-ro[0].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_service_account_iam_binding.authoritative is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.pf-sa-ro[0].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be destroyed
  # (because google_storage_bucket_iam_member.bucket-roles is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/organizations/350989124418/roles/storageViewer/serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "organizations/350989124418/roles/storageViewer" -> null
    }

  # module.pf-sa-rw[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/iam.serviceAccountAdmin"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/iam.serviceAccountAdmin/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/iam.serviceAccountAdmin" -> null
    }

  # module.pf-sa-rw[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.pf-sa-rw[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/storage.admin"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbu069KM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/storage.admin/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/storage.admin" -> null
    }

  # module.pf-sa-rw[0].google_service_account.service_account[0] will be destroyed
  # (because google_service_account.service_account is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-resman-pf-0" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman project factory main service account." -> null
      - email        = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "103423208545837491635" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pf-sa-rw[0].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_service_account_iam_binding.authoritative is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.pf-sa-rw[0].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be destroyed
  # (because google_storage_bucket_iam_member.bucket-roles is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/roles/storage.objectAdmin/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectAdmin" -> null
    }

  # module.sec-bucket[0].google_storage_bucket.bucket[0] will be destroyed
  # (because google_storage_bucket.bucket is not in configuration)
  - resource "google_storage_bucket" "bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "ten21-prod-resman-sec-0" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "ten21-prod-resman-sec-0" -> null
      - project                     = "ten21-prod-iac-core-0" -> null
      - project_number              = 417203162051 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/ten21-prod-resman-sec-0" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://ten21-prod-resman-sec-0" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-02-18T14:56:14.270Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.sec-bucket[0].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be destroyed
  # (because google_storage_bucket_iam_binding.authoritative is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-prod-resman-sec-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-prod-resman-sec-0/roles/storage.objectAdmin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.sec-bucket[0].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be destroyed
  # (because google_storage_bucket_iam_binding.authoritative is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-prod-resman-sec-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-prod-resman-sec-0/roles/storage.objectViewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectViewer" -> null
    }

  # module.sec-folder[0].google_folder.folder[0] will be destroyed
  # (because google_folder.folder is not in configuration)
  - resource "google_folder" "folder" {
      - create_time         = "2025-02-18T15:11:55.772Z" -> null
      - deletion_protection = false -> null
      - display_name        = "Security" -> null
      - folder_id           = "400949762104" -> null
      - id                  = "folders/400949762104" -> null
      - lifecycle_state     = "ACTIVE" -> null
      - name                = "folders/400949762104" -> null
      - parent              = "organizations/350989124418" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["organizations/350989124418/roles/projectIamViewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/organizations/350989124418/roles/projectIamViewer" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "organizations/350989124418/roles/projectIamViewer" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/cloudkms.cryptoKeyEncrypterDecrypter"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/cloudkms.viewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/cloudkms.viewer" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/cloudkms.viewer" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/editor"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/editor" -> null
      - members = [
          - "group:gcp-security-admins@tentwentyone.io",
        ] -> null
      - role    = "roles/editor" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/logging.admin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/logging.admin" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/owner"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/owner" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/owner" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/resourcemanager.folderAdmin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.folderAdmin" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderViewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/resourcemanager.folderViewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.folderViewer" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/resourcemanager.projectCreator" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.projectCreator" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.tagUser"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/resourcemanager.tagUser" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.tagUser" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.tagViewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/resourcemanager.tagViewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.tagViewer" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.authoritative["roles/viewer"] will be destroyed
  # (because google_folder_iam_binding.authoritative is not in configuration)
  - resource "google_folder_iam_binding" "authoritative" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/viewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/viewer" -> null
    }

  # module.sec-folder[0].google_folder_iam_binding.bindings["pf_delegated_grant"] will be destroyed
  # (because google_folder_iam_binding.bindings is not in configuration)
  - resource "google_folder_iam_binding" "bindings" {
      - etag    = "BwYubBTGsto=" -> null
      - folder  = "folders/400949762104" -> null
      - id      = "folders/400949762104/roles/resourcemanager.projectIamAdmin/pf_delegated_grant/Project factory delegated grant./api.getAttribute('iam.googleapis.com/modifiedGrantsByRole', []).hasOnly(['roles/cloudkms.cryptoKeyEncrypterDecrypter'])" -> null
      - members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/resourcemanager.projectIamAdmin" -> null

      - condition {
          - description = "Project factory delegated grant." -> null
          - expression  = "api.getAttribute('iam.googleapis.com/modifiedGrantsByRole', []).hasOnly(['roles/cloudkms.cryptoKeyEncrypterDecrypter'])" -> null
          - title       = "pf_delegated_grant" -> null
        }
    }

  # module.sec-folder[0].google_tags_tag_binding.binding["context"] will be destroyed
  # (because google_tags_tag_binding.binding is not in configuration)
  - resource "google_tags_tag_binding" "binding" {
      - id        = "tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F400949762104/tagValues/281481940685572" -> null
      - name      = "%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F400949762104/tagValues/281481940685572" -> null
      - parent    = "//cloudresourcemanager.googleapis.com/folders/400949762104" -> null
      - tag_value = "tagValues/281481940685572" -> null
    }

  # module.sec-sa-ro[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.sec-sa-ro[0].google_service_account.service_account[0] will be destroyed
  # (because google_service_account.service_account is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-prod-resman-sec-0r" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman security service account (read-only)." -> null
      - email        = "ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "102181181759013965345" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sec-sa-ro[0].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_service_account_iam_binding.authoritative is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.sec-sa-ro[0].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be destroyed
  # (because google_storage_bucket_iam_member.bucket-roles is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/organizations/350989124418/roles/storageViewer/serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "organizations/350989124418/roles/storageViewer" -> null
    }

  # module.sec-sa-rw[0].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.sec-sa-rw[0].google_service_account.service_account[0] will be destroyed
  # (because google_service_account.service_account is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-prod-resman-sec-0" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman security service account." -> null
      - email        = "ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "108392888656232994361" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sec-sa-rw[0].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_service_account_iam_binding.authoritative is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.sec-sa-rw[0].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be destroyed
  # (because google_storage_bucket_iam_member.bucket-roles is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/roles/storage.objectAdmin/serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectAdmin" -> null
    }

  # module.stage2-bucket["networking"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "ten21-prod-resman-net-0"
      + project                     = "ten21-prod-iac-core-0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.stage2-bucket["networking"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-prod-resman-net-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.stage2-bucket["networking"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-prod-resman-net-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectViewer"
    }

  # module.stage2-bucket["project-factory"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "ten21-prod-resman-pf-0"
      + project                     = "ten21-prod-iac-core-0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.stage2-bucket["project-factory"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-prod-resman-pf-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.stage2-bucket["project-factory"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-prod-resman-pf-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectViewer"
    }

  # module.stage2-bucket["security"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "ten21-prod-resman-sec-0"
      + project                     = "ten21-prod-iac-core-0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.stage2-bucket["security"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-prod-resman-sec-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.stage2-bucket["security"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-prod-resman-sec-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectViewer"
    }

  # module.stage2-folder["networking"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time         = (known after apply)
      + deletion_protection = false
      + display_name        = "Networking"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + lifecycle_state     = (known after apply)
      + name                = (known after apply)
      + parent              = "organizations/350989124418"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["organizations/350989124418/roles/projectIamViewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/350989124418/roles/projectIamViewer"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["organizations/350989124418/roles/serviceProjectNetworkAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/350989124418/roles/serviceProjectNetworkAdmin"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/compute.networkViewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/compute.networkViewer"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/compute.xpnAdmin"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/editor"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-vpc-network-admins@tentwentyone.io",
        ]
      + role    = "roles/editor"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderViewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderViewer"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/resourcemanager.tagUser"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.tagUser"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/resourcemanager.tagViewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.tagViewer"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/viewer"
    }

  # module.stage2-folder["networking"].google_folder_iam_binding.bindings["project_factory"] will be created
  + resource "google_folder_iam_binding" "bindings" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectIamAdmin"

      + condition {
          + expression = <<-EOT
                api.getAttribute('iam.googleapis.com/modifiedGrantsByRole', []).hasOnly([
                  'roles/compute.networkUser', 'roles/composer.sharedVpcAgent',
                  'roles/container.hostServiceAgentUser', 'roles/vpcaccess.user'
                ])
            EOT
          + title      = "Project factory delegated IAM grant."
        }
    }

  # module.stage2-folder["networking"].google_tags_tag_binding.binding["context"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/281481730502710"
    }

  # module.stage2-folder["security"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time         = (known after apply)
      + deletion_protection = false
      + display_name        = "Security"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + lifecycle_state     = (known after apply)
      + name                = (known after apply)
      + parent              = "organizations/350989124418"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["organizations/350989124418/roles/projectIamViewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/350989124418/roles/projectIamViewer"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/cloudkms.cryptoKeyEncrypterDecrypter"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/cloudkms.viewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/cloudkms.viewer"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/editor"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-security-admins@tentwentyone.io",
        ]
      + role    = "roles/editor"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderViewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderViewer"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/resourcemanager.tagUser"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.tagUser"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/resourcemanager.tagViewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.tagViewer"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/viewer"
    }

  # module.stage2-folder["security"].google_folder_iam_binding.bindings["project_factory"] will be created
  + resource "google_folder_iam_binding" "bindings" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectIamAdmin"

      + condition {
          + expression = <<-EOT
                api.getAttribute('iam.googleapis.com/modifiedGrantsByRole', []).hasOnly([
                  'roles/cloudkms.cryptoKeyEncrypterDecrypter'
                ])
            EOT
          + title      = "Project factory delegated IAM grant."
        }
    }

  # module.stage2-folder["security"].google_tags_tag_binding.binding["context"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/281481940685572"
    }

  # module.stage2-folder-env["networking-dev"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time         = (known after apply)
      + deletion_protection = false
      + display_name        = "Development"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + lifecycle_state     = (known after apply)
      + name                = (known after apply)
      + parent              = (known after apply)
    }

  # module.stage2-folder-env["networking-dev"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/281476507938981"
    }

  # module.stage2-folder-env["networking-prod"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time         = (known after apply)
      + deletion_protection = false
      + display_name        = "Production"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + lifecycle_state     = (known after apply)
      + name                = (known after apply)
      + parent              = (known after apply)
    }

  # module.stage2-folder-env["networking-prod"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/281483010995173"
    }

  # module.stage2-sa-ro["networking"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.stage2-sa-ro["networking"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-prod-resman-net-0r"
      + disabled     = false
      + display_name = "Terraform resman networking service account (read-only)."
      + email        = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.stage2-sa-ro["networking"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.stage2-sa-ro["networking"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "ten21-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "organizations/350989124418/roles/storageViewer"
    }

  # module.stage2-sa-ro["project-factory"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.stage2-sa-ro["project-factory"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-prod-resman-pf-0r"
      + disabled     = false
      + display_name = "Terraform resman project-factory service account (read-only)."
      + email        = "ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.stage2-sa-ro["project-factory"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.stage2-sa-ro["project-factory"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "ten21-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "organizations/350989124418/roles/storageViewer"
    }

  # module.stage2-sa-ro["security"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.stage2-sa-ro["security"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-prod-resman-sec-0r"
      + disabled     = false
      + display_name = "Terraform resman security service account (read-only)."
      + email        = "ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-prod-resman-sec-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.stage2-sa-ro["security"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.stage2-sa-ro["security"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "ten21-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "organizations/350989124418/roles/storageViewer"
    }

  # module.stage2-sa-rw["networking"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # module.stage2-sa-rw["networking"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.stage2-sa-rw["networking"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/storage.admin"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/storage.admin"
    }

  # module.stage2-sa-rw["networking"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-prod-resman-net-0"
      + disabled     = false
      + display_name = "Terraform resman networking service account."
      + email        = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.stage2-sa-rw["networking"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.stage2-sa-rw["networking"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "ten21-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.stage2-sa-rw["project-factory"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # module.stage2-sa-rw["project-factory"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.stage2-sa-rw["project-factory"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/storage.admin"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/storage.admin"
    }

  # module.stage2-sa-rw["project-factory"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-prod-resman-pf-0"
      + disabled     = false
      + display_name = "Terraform resman project-factory service account."
      + email        = "ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.stage2-sa-rw["project-factory"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.stage2-sa-rw["project-factory"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "ten21-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.stage2-sa-rw["security"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # module.stage2-sa-rw["security"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.stage2-sa-rw["security"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/storage.admin"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-prod-iac-core-0"
      + role    = "roles/storage.admin"
    }

  # module.stage2-sa-rw["security"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-prod-resman-sec-0"
      + disabled     = false
      + display_name = "Terraform resman security service account."
      + email        = "ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.stage2-sa-rw["security"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.stage2-sa-rw["security"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "ten21-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.stage3-bucket["project-factory-dev"].google_storage_bucket.bucket[0] will be destroyed
  # (because module.stage3-bucket["project-factory-dev"] is not in configuration)
  - resource "google_storage_bucket" "bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "ten21-dev-resman-pf-0" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "ten21-dev-resman-pf-0" -> null
      - project                     = "ten21-prod-iac-core-0" -> null
      - project_number              = 417203162051 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/ten21-dev-resman-pf-0" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://ten21-dev-resman-pf-0" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-02-18T14:56:25.329Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.stage3-bucket["project-factory-dev"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be destroyed
  # (because module.stage3-bucket["project-factory-dev"] is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-dev-resman-pf-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-dev-resman-pf-0/roles/storage.objectAdmin" -> null
      - members = [
          - "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.stage3-bucket["project-factory-dev"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be destroyed
  # (because module.stage3-bucket["project-factory-dev"] is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-dev-resman-pf-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-dev-resman-pf-0/roles/storage.objectViewer" -> null
      - members = [
          - "serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectViewer" -> null
    }

  # module.stage3-bucket["project-factory-prod"].google_storage_bucket.bucket[0] will be destroyed
  # (because module.stage3-bucket["project-factory-prod"] is not in configuration)
  - resource "google_storage_bucket" "bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "ten21-prod-resman-pf-0" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "ten21-prod-resman-pf-0" -> null
      - project                     = "ten21-prod-iac-core-0" -> null
      - project_number              = 417203162051 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/ten21-prod-resman-pf-0" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://ten21-prod-resman-pf-0" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-02-18T14:56:27.843Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.stage3-bucket["project-factory-prod"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectAdmin"] will be destroyed
  # (because module.stage3-bucket["project-factory-prod"] is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-prod-resman-pf-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-prod-resman-pf-0/roles/storage.objectAdmin" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.stage3-bucket["project-factory-prod"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be destroyed
  # (because module.stage3-bucket["project-factory-prod"] is not in configuration)
  - resource "google_storage_bucket_iam_binding" "authoritative" {
      - bucket  = "b/ten21-prod-resman-pf-0" -> null
      - etag    = "CAM=" -> null
      - id      = "b/ten21-prod-resman-pf-0/roles/storage.objectViewer" -> null
      - members = [
          - "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectViewer" -> null
    }

  # module.stage3-sa-ro["project-factory-dev"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because module.stage3-sa-ro["project-factory-dev"] is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.stage3-sa-ro["project-factory-dev"].google_service_account.service_account[0] will be destroyed
  # (because module.stage3-sa-ro["project-factory-dev"] is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-dev-resman-pf-0r" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman project-factory-dev service account (read-only)." -> null
      - email        = "ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "117571147576192022286" -> null
        # (1 unchanged attribute hidden)
    }

  # module.stage3-sa-ro["project-factory-dev"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because module.stage3-sa-ro["project-factory-dev"] is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.stage3-sa-ro["project-factory-dev"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be destroyed
  # (because module.stage3-sa-ro["project-factory-dev"] is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/organizations/350989124418/roles/storageViewer/serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-dev-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "organizations/350989124418/roles/storageViewer" -> null
    }

  # module.stage3-sa-ro["project-factory-prod"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because module.stage3-sa-ro["project-factory-prod"] is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.stage3-sa-ro["project-factory-prod"].google_service_account.service_account[0] will be destroyed
  # (because module.stage3-sa-ro["project-factory-prod"] is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-prod-resman-pf-0r" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman project-factory-prod service account (read-only)." -> null
      - email        = "ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "103625093889017277567" -> null
        # (1 unchanged attribute hidden)
    }

  # module.stage3-sa-ro["project-factory-prod"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because module.stage3-sa-ro["project-factory-prod"] is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.stage3-sa-ro["project-factory-prod"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-organizations/350989124418/roles/storageViewer"] will be destroyed
  # (because module.stage3-sa-ro["project-factory-prod"] is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/organizations/350989124418/roles/storageViewer/serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "organizations/350989124418/roles/storageViewer" -> null
    }

  # module.stage3-sa-rw["project-factory-dev"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because module.stage3-sa-rw["project-factory-dev"] is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.stage3-sa-rw["project-factory-dev"].google_service_account.service_account[0] will be destroyed
  # (because module.stage3-sa-rw["project-factory-dev"] is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-dev-resman-pf-0" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman project-factory-dev service account." -> null
      - email        = "ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "100315020576982791068" -> null
        # (1 unchanged attribute hidden)
    }

  # module.stage3-sa-rw["project-factory-dev"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because module.stage3-sa-rw["project-factory-dev"] is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.stage3-sa-rw["project-factory-dev"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be destroyed
  # (because module.stage3-sa-rw["project-factory-dev"] is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/roles/storage.objectAdmin/serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectAdmin" -> null
    }

  # module.stage3-sa-rw["project-factory-prod"].google_project_iam_member.project-roles["ten21-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be destroyed
  # (because module.stage3-sa-rw["project-factory-prod"] is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwYvbn3nTgM=" -> null
      - id      = "ten21-prod-iac-core-0/roles/serviceusage.serviceUsageConsumer/serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project = "ten21-prod-iac-core-0" -> null
      - role    = "roles/serviceusage.serviceUsageConsumer" -> null
    }

  # module.stage3-sa-rw["project-factory-prod"].google_service_account.service_account[0] will be destroyed
  # (because module.stage3-sa-rw["project-factory-prod"] is not in configuration)
  - resource "google_service_account" "service_account" {
      - account_id   = "ten21-prod-resman-pf-0" -> null
      - disabled     = false -> null
      - display_name = "Terraform resman project-factory-prod service account." -> null
      - email        = "ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - id           = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - name         = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - project      = "ten21-prod-iac-core-0" -> null
      - unique_id    = "100705989726363876707" -> null
        # (1 unchanged attribute hidden)
    }

  # module.stage3-sa-rw["project-factory-prod"].google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because module.stage3-sa-rw["project-factory-prod"] is not in configuration)
  - resource "google_service_account_iam_binding" "authoritative" {
      - id                 = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> null
      - members            = [] -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/ten21-prod-iac-core-0/serviceAccounts/ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
    }

  # module.stage3-sa-rw["project-factory-prod"].google_storage_bucket_iam_member.bucket-roles["ten21-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be destroyed
  # (because module.stage3-sa-rw["project-factory-prod"] is not in configuration)
  - resource "google_storage_bucket_iam_member" "bucket-roles" {
      - bucket = "b/ten21-prod-iac-core-outputs-0" -> null
      - etag   = "CBo=" -> null
      - id     = "b/ten21-prod-iac-core-outputs-0/roles/storage.objectAdmin/serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectAdmin" -> null
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["organizations/350989124418/roles/serviceProjectNetworkAdmin"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/organizations/350989124418/roles/serviceProjectNetworkAdmin"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["roles/owner"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/roles/owner"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/roles/resourcemanager.folderAdmin"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderViewer"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/roles/resourcemanager.folderViewer"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/roles/resourcemanager.projectCreator"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["roles/resourcemanager.tagUser"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/roles/resourcemanager.tagUser"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["roles/resourcemanager.tagViewer"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/roles/resourcemanager.tagViewer"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.authoritative["roles/viewer"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/379949197155/roles/viewer"
      ~ members = [
          - "serviceAccount:ten21-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.top-level-folder["teams"].google_folder_iam_binding.bindings["pf_viewer"] will be created
  + resource "google_folder_iam_binding" "bindings" {
      + etag    = (known after apply)
      + folder  = "folders/379949197155"
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-prod-resman-pf-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/350989124418/roles/organizationAdminViewer"
    }

Plan: 82 to add, 15 to change, 133 to destroy.
```